Revit 2024 API
IDirectContext3DServer.UseInTransparentPass Method
 Indicates whether this server will submit geometry during the rendering pass for transparent geometry.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
bool UseInTransparentPass(
	View dBView
)
Visual Basic
Function UseInTransparentPass ( _
	dBView As View _
) As Boolean
Visual C++
bool UseInTransparentPass(
	View^ dBView
)
Parameters
dBView
Type: Autodesk.Revit.DB.View
 The view where rendering will occur.
Return Value
 True if the server needs to render transparent geometry, false otherwise.
Remarks
Transparent geometry is rendered in a separate pass following the opaque geometry. If a server returns true from UseInTransparentPass(), it can provide geometry for rendering in either pass using the RenderScene() method. Otherwise, the server will be called to submit only opaque geometry.
The server has a way to determine whether it should submit opaque or transparent geometry when RenderScene() is called (see Autodesk::Revit::DB::DirectContext3D::DrawContext::IsTransparentPass(void)).
See Also
IDirectContext3DServer Interface
Autodesk.Revit.DB.DirectContext3D Namespace